// Για την αντιστοίχηση σχολών και τμημάτων

export const SCHOOLS: { value: string; label: string }[] = [
    { value: "agrotiki", label: "Αγροτικής Ανάπτυξης, Διατροφής και Αειφορίας" },
    { value: "agogi",    label: "Επιστημών Αγωγής" },
    { value: "ygeia",    label: "Επιστημών Υγείας" },
    { value: "sport",    label: "Επιστήμης Φυσικής Αγωγής και Αθλητισμού" },
    { value: "theol",    label: "Θεολογική" },
    { value: "thetikes", label: "Θετικών Επιστημών" },
    { value: "nomiki",   label: "Νομική" },
    { value: "oik",      label: "Οικονομικών και Πολιτικών Επιστημών" },
    { value: "filosof",  label: "Φιλοσοφική" },
]

export const DEPARTMENTS: Record<string, string[]> = {
    agrotiki: [
        "Αγροτικής Ανάπτυξης, Αγροδιατροφής και Διαχείρισης Φυσικών Πόρων"
    ],
    agogi: [
        "Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης",
        "Εκπαίδευσης και Αγωγής στην Προσχολική Ηλικία"
    ],
    ygeia: [
        "Ιατρικής",
        "Οδοντιατρικής",
        "Φαρμακευτικής",
        "Νοσηλευτικής"
    ],
    sport: [
        "Επιστήμης Φυσικής Αγωγής και Αθλητισμού"
    ],
    theol: [
        "Θεολογίας",
        "Κοινωνικής Θεολογίας και Χριστιανικού Πολιτισμού"
    ],
    thetikes: [
        "Αεροδιαστημικής Επιστήμης και Τεχνολογίας",
        "Βιολογίας",
        "Γεωλογίας και Γεωπεριβάλλοντος",
        "Ιστορίας και Φιλοσοφίας της Επιστήμης",
        "Μαθηματικών",
        "Πληροφορικής και Τηλεπικοινωνιών",
        "Τεχνολογιών Ψηφιακής Βιομηχανίας",
        "Φυσικής",
        "Χημείας"
    ],
    nomiki: [
        "Νομικής"
    ],
    oik: [
        "Διαχείρισης Λιμένων και Ναυτιλίας",
        "Διοίκησης Επιχειρήσεων και Οργανισμών",
        "Επικοινωνίας και Μέσων Μαζικής Ενημέρωσης",
        "Κοινωνιολογίας",
        "Οικονομικών Επιστημών",
        "Πολιτικής Επιστήμης και Δημόσιας Διοίκησης",
        "Τουρκικών Σπουδών και Σύγχρονων Ασιατικών Σπουδών",
        "Ψηφιακών Τεχνών και Κινηματογράφου"
    ],
    filosof: [
        "Αγγλικής Γλώσσας και Φιλολογίας",
        "Γαλλικής Γλώσσας και Φιλολογίας",
        "Γερμανικής Γλώσσας και Φιλολογίας",
        "Θεατρικών Σπουδών",
        "Ισπανικής Γλώσσας και Φιλολογίας",
        "Ιστορίας και Αρχαιολογίας",
        "Ιταλικής Γλώσσας και Φιλολογίας",
        "Μουσικών Σπουδών",
        "Παιδαγωγικό Τμήμα Δευτεροβάθμιας Εκπαίδευσης",
        "Ρωσικής Γλώσσας και Φιλολογίας και Σλαβικών Σπουδών",
        "Φιλολογίας",
        "Φιλοσοφίας",
        "Ψυχολογίας"
    ]
}
